The  DuctFittingAndAccessoryPressureDropUIData  type exposes the following members.
 Properties
Name  |   Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 See Also
  DuctFittingAndAccessoryPressureDropUIData Class
  Autodesk.Revit.UI.Mechanical Namespace